/* Chapter : 7 - item : 5 - (4) บัตรปชช

นักศึกษาทำบัตรประชาชนหาย และขี้เกียจไปทำใหม่ นักศึกษาจึงได้ตัดสินใจ
เขียนโปรแกรมให้พิมพ์บัตรออกมาใหม่แทน โดยลักษณะของบัตรคือ

======================
| 1                  |
| ------------------ |
| Age : 2            |
| Jobs : 3           |
======================
1. แสดงชื่อ
2. แสดงอายุ
3. แสดงอาชีพ

INPUT
ตัวอักษรชุดนึง ตัวเลข และตัวอักษรอีกชุดนึง ตามลำดับ
สมมติว่าตัวอักษรที่ใส่เข้ามาจะไม่ยาวเกินบัตรแน่ ๆ
* บัตรมีขนาด 22 x 6 ช่อง ใช้ตัวอักษร 4 ตัวนี้ในการสร้าง ( = ) ( - ) ( : ) ( | )

ปล. แสดงให้เหมือนเป๊ะ ๆ นะ
# เอาโค้ดข้างล่างนี้ไปเขียนต่อนะ เพิ่มได้ ลดไม่ได้

#include <stdio.h>

void print_id_card(char name[], char job[], int age);

int main()
{
    // CODE HERE //
}
*/
